---
title: ClipPlane
classe: Autodesk.Revit.DB.DirectContext3D.ClipPlane
namespace: Autodesk.Revit.DB.DirectContext3D
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# ClipPlane

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `clipPlane.IsValidObject` | Boolean |
| `XYZ Normal { get; set; }` | `clipPlane.Normal` | XYZ |
| `XYZ Origin { get; set; }` | `clipPlane.Origin` | XYZ |
| `Void Dispose()` | `clipPlane.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```